Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་བས་ཀྱང་རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་། །དེ་བས་ཀྱང་འཛམ་བུའི་གླིང་གི་མི་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: There are even fewer who have actually entered upon individual enlightenment, and there are even fewer who have actually entered upon unsurpassed, complete enlightenment.” “

source: ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ།
en: Kauśika, it is so!

source: །དེ་དེ་བཞིན་ཏེ། འཛམ་བུའི་གླིང་གི་མི་དེ་དག་ལས།
en: It is so!”

source: སངས་རྒྱས་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་།
en: said the Blessed One. “

source: ཆོས་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། དགེ་འདུན་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། སངས་རྒྱས་ལ་ནེམ་ནུར་མེད་པ་དང་། ཆོས་ལ་ནེམ་ནུར་མེད་པ་དང་། དགེ་འདུན་ལ་ནེམ་ནུར་མེད་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: Among the human beings of Jambudvīpa, there are few who have unbroken devotion to the buddhas, unbroken devotion to the Dharma, and unbroken devotion to the saṅgha; who are without hesitation concerning the buddhas, without hesitation concerning the Dharma, and without hesitation concerning the saṅgha; and who are utterly convinced about the buddhas, utterly convinced about the Dharma, and utterly convinced about the saṅgha.

source: །དེ་བས་ཀྱང་སངས་རྒྱས་ལ་ཤིན་དུ་རྟོན་པ་དང་། ཆོས་ལ་ཤིན་དུ་རྟོན་པ་དང་། དགེ་འདུན་ལ་ཤིན་དུ་རྟོན་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་། །དེ་བས་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have attained the thirty-seven factors conducive to enlightenment.

source: །དེ་བས་ཀྱང་རྒྱུན་དུ་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have entered the stream to nirvāṇa.

source: །དེ་བས་ཀྱང་ལན་ཅིག་ཕྱིར་འོང་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who are destined for only one more rebirth.

source: །དེ་བས་ཀྱང་ཕྱིར་མི་འོང་བར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who are no longer subject to rebirth.

source: །དེ་བས་ཀྱང་དགྲ་བཅོམ་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have become arhats.

source: །དེ་བས་ཀྱང་རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་། །དེ་བས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer who have actually entered upon individual enlightenment, and there are even fewer who have actually entered upon unsurpassed, complete enlightenment.

source: །དེ་བས་ཀྱང་བྱང་ཆུབ་ཏུ་སྤྱོད་པར་གྱུར་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: There are even fewer who are engaged in enlightenment. “

source: དེ་ནི་འདི་ལྟར་སྔོན་འཁོར་བ་ན་འཁོར་བའི་ཚེ། སངས་རྒྱས་མ་མཐོང་བ་དང་། ཆོས་མ་ཐོས་པ་དང་། དགེ་འདུན་ལ་བསྙེན་མ་བཀུར་བ་དང་། སྦྱིན་པ་མ་བྱིན་པ་དང་། ཚུལ་ཁྲིམས་མ་བསྲུངས་པ་དང་། བཟོད་པ་མ་བསྒོམས་པ་དང་། བརྩོན་འགྲུས་མ་བརྩམས་པ་དང་། བསམ་གཏན་མ་བསྒོམས་པ་དང་།
en: If you ask why, it is because formerly when they roamed through cyclic existence, they did not see the buddhas, they did not hear the Dharma, they did not venerate the saṅgha, they did not dispense gifts, they did not maintain ethical discipline, they did not cultivate tolerance, they did not undertake perseverance, they did not cultivate meditative concentration, and they did not cultivate wisdom.

source: ཤེས་རབ་མ་བསྒོམས་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཐོས་མ་བསྒོམས་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They did not hear of or cultivate the perfection of generosity, and they did not hear of or cultivate the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཐོས་མ་བསྒོམས་པ་དང་། ནང་སྟོང་པ་ཉིད་མ་ཐོས་མ་བསྒོམས་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མ་ཐོས་མ་བསྒོམས་པ་དང་།
en: They did not hear of or cultivate the emptiness of internal phenomena, and they did not hear of or cultivate [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མ་ཐོས་མ་བསྒོམས་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་མ་ཐོས་མ་བསྒོམས་པ་དང་།
en: They did not hear of or cultivate the applications of mindfulness, and they did not hear of or cultivate [the other causal attributes], up to and including the noble eightfold path.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་མ་ཐོས་མ་བསྒོམས་པ་དང་།
en: They did not hear of or cultivate [the fruitional attributes], up to and including the distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མ་ཐོས་མ་བསྒོམས་པའི་ཕྱིར་རོ།
en: They did not hear of or cultivate [the fruits and realizations], up to and including all-aspect omniscience. “

source: །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ན་འདི་ལྟར་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ལས། སངས་རྒྱས་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། ཆོས་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དང་། དགེ་འདུན་ལ་མོས་པ་མི་ཕྱེད་པ་དང་ལྡན་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་སྟེ།
en: Kauśika, as that perspective explains, among the human beings of Jambudvīpa there are thus very few who have unbroken devotion to the buddhas, unbroken devotion to the Dharma, and unbroken devotion to the saṅgha. {

source: དེ་བས་ཀྱང་རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པའི་བར་དུ་ཆེས་ཉུང་ངོ་།
en: Ki.II-III: 61} There are even fewer who have [attained the causal and fruitional attributes and] actually entered upon [the fruits and realizations], up to and including individual enlightenment.

source: །དེ་བས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པར་གྱུར་པ་ཆེས་ཉུང་ངོ་། །དེ་བས་ཀྱང་བསམ་པ་དག་པས་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་ནི་ཆེས་ཉུང་བར་རིག་པར་བྱའོ།
en: There are even fewer who have actually entered upon unsurpassed, complete enlightenment, and you should know that there are even fewer who are engaged in enlightenment with pure aspiration. “

source: །ཀཽ་ཤི་ཀ་མི་རྣམས་ལྟ་ཞོག་གི་དེ་ཇི་སྙམ་དུ་སེམས། འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་རྣམས་ལས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ་དང་།
en: Kauśika, leaving aside human beings, among the other living creatures of Jambudvīpa, how many do you think have attained the thirty-seven factors conducive to enlightenment?

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཐོབ་པ་དང་།
en: How many have attained the three gateways of liberation?

source: རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་པ་དང་།
en: How many have attained the eight aspects of liberation?

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཐོབ་པ་དང་།
en: How many have attained the nine serial steps of meditative absorption?

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པ་དང་།
en: How many have attained the four kinds of exact knowledge?

source: འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་རྣམས་ལས། ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤངས་པའི་ཕྱིར། རྒྱུན་དུ་ཞུགས་པར་གྱུར་པ་དང་།
en: Among those other living creatures of Jambudvīpa, how many do you think have entered the stream to nirvāṇa in order to abandon the three fetters?

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བསྲབས་པའི་ཕྱིར། ལན་ཅིག་ཕྱིར་འོང་བར་གྱུར་པ་དང་།
en: How many are destined for only one more rebirth in order to wear down desire, hatred, and delusion?

source: དམ་པ་མ་ཡིན་པའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་ཕྱིར། ཕྱིར་མི་འོང་བར་གྱུར་པ་དང་།
en: How many are no longer subject to rebirth in order to abandon the five fetters associated with the lower realms?

source: བླ་མའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་ཕྱིར། དགྲ་བཅོམ་པར་གྱུར་པ་དང་།
en: How many have become arhats in order to abandon the five fetters associated with the higher realms?

source: རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many have actually entered upon individual enlightenment?

source: འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་རྣམས་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ནེམ་ནུར་མེད་པ་དང་།
en: Among the other living creatures of Jambudvīpa, how many are without hesitation concerning unsurpassed, complete enlightenment?

source: སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་ནེམ་ནུར་མེད་པ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: How many are without hesitation concerning the buddhas, the Dharma, and the saṅgha?

source: འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་རྣམས་ལས་མར་ཤེས་པ་དང་། པར་ཤེས་པ་དང་། དགེ་སྦྱོང་དུ་ཤེས་པ་དང་། བྲམ་ཟེར་ཤེས་པ་དང་།
en: Among the other living creatures of Jambudvīpa, how many appreciate their mother, appreciate their father, appreciate virtuous ascetics, or appreciate brāhmin priests?

source: རིགས་ཀྱི་གཙོ་བོ་ལ་རིམ་གྲོ་བྱེད་པ་དང་།
en: How many serve the venerable ones within the family?

source: སྦྱིན་པ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་བསྲུང་བ་དང་། གསོ་སྦྱིན་ལ་གནས་པ་དང་།
en: How many dispense gifts, maintain ethical discipline, and maintain the restoration and purification of vows?

source: འདོད་པ་ལ་ཁ་ན་མ་ཐོ་བར་འདུ་ཤེས་ཤིང་རྣམ་པར་སྤྱོད་པ་དང་།
en: How many perceive and analyze desire as an inadmissible transgression?

source: དེ་བཞིན་དུ་མི་རྟག་པར་འདུ་ཤེས་པ་དང་། བདག་མེད་པར་འདུ་ཤེས་པ་དང་། མི་གཙང་བར་འདུ་ཤེས་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དུ་མངོན་པར་དགའ་བ་མེད་པར་འདུ་ཤེས་པ་ནི་ཇི་སྙེད་ཅིག་ཡོད།
en: Similarly, how many perceive that the body is impermanent, perceive that it is without self, perceive that it is impure, and perceive there is no delight anywhere in the world?

source: འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་རྣམས་ལས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་ནི་ཇི་སྙེད་ཅིག་ཡོད། བརྒྱ་བྱིན་གྱིས་གསོལ་པ།
en: Among the other living creatures of Jambudvīpa, how many have actually entered upon unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་རྣམས་ལས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཐོབ་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཐོབ་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དང་། ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤངས་པའི་སླད་དུ། རྒྱུན་དུ་ཞུགས་པར་གྱུར་པ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བསྲབས་པའི་སླད་དུ། ལན་ཅིག་ཕྱིར་འོང་བར་གྱུར་པ་དང་། དམ་པ་མ་ལགས་པའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་སླད་དུ། ཕྱིར་མི་འོང་བར་གྱུར་པ་དང་། བླ་མའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་སླད་དུ། དགྲ་བཅོམ་པར་གྱུར་པ་དང་། རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་ཤིན་དུ་ཉུང་ངོ་།
en: Blessed Lord,” replied Śakra, “among the other living creatures of Jambudvīpa, there are indeed extremely few that have attained the thirty-seven factors conducive to enlightenment, that have attained the three gateways of liberation, that have attained the eight aspects of liberation, that have attained the nine serial steps of meditative absorption, that have attained the four kinds of exact knowledge, that have attained the six extrasensory powers, that have entered the stream to nirvāṇa in order to abandon the three fetters, that are destined for only one more rebirth in order to wear down desire, hatred, and delusion, that are no longer subject to rebirth in order to abandon the five fetters associated with the lower realms, that have become arhats in order to abandon the five fetters associated with the higher realms, or that have actually entered upon individual enlightenment.

source: །བཅོམ་ལྡན་འདས་འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་ལས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་དེ་བས་ཀྱང་ཆེས་ཉུང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, among the other living creatures of Jambudvīpa, far fewer than that have actually entered upon unsurpassed, complete enlightenment.” “

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ། ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སྲོག་ཆགས་ལས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཐོབ་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ཐོབ་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་ཐོབ་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཐོབ་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་ཐོབ་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པ་དང་། ཀུན་དུ་སྦྱོར་བ་གསུམ་སྤངས་པའི་ཕྱིར།
en: It is as you have said!”

source: རྒྱུན་དུ་ཞུགས་པ་ཐོབ་པ་དང་།
en: replied the Blessed One. “

source: འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བསྲབས་པའི་ཕྱིར། ལན་ཅིག་ཕྱིར་འོང་བར་གྱུར་པ་དང་། དམ་པ་མ་ཡིན་པའི་ཆའི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་ཕྱིར། ཕྱིར་མི་འོང་བར་གྱུར་པ་དང་། བླ་མའི་ཆ་ཅན་གྱི་ཀུན་དུ་སྦྱོར་བ་ལྔ་སྤངས་པའི་ཕྱིར།
en: Kauśika, among the other living creatures of Jambudvīpa, there are few that have attained the thirty-seven factors conducive to enlightenment, that have attained the three gateways of liberation, that have attained the eight aspects of liberation, that have attained the nine serial steps of meditative absorption, that have attained the four kinds of exact knowledge, that have attained the six extrasensory powers, that have entered the stream to nirvāṇa in order to abandon the three fetters, that are destined for only one more rebirth in order to wear down desire, hatred, and delusion, that are no longer subject to rebirth in order to abandon the five fetters associated with the lower realms, that have become arhats in order to abandon the five fetters associated with the higher realms, that have actually entered upon individual enlightenment, and that have actually entered upon unsurpassed, complete enlightenment.

source: དགྲ་བཅོམ་པར་གྱུར་པ་དང་། རང་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་ལྟ་བུ་ནི་ཉུང་སྟེ། དེ་བས་ཀྱང་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་། །དེ་བས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་པར་འདོད་པ་དེ་ལྟ་བུ་ནི་ཆེས་ཉུང་ངོ་།
en: There are even fewer than those that are engaged in unsurpassed, complete enlightenment, and there are even fewer than those that seek to attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: །ཀཽ་ཤི་ཀ་ངས་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་བསྒྲིབས་པ་མེད་པས། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྤྱོད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་དང་མི་ལྡན་པས། དེ་ལས་གཅིག་གམ་གཉིས་ཤིག་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་འགྱུར་གྱི། དེ་ལས་ཕལ་ཆེར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལ་གནས་པར་འགྱུར་བ་མཐོང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Kauśika, from here I see with my unobscured buddha eyes that although there are immeasurable, countless beings who are engaged in unsurpassed, complete enlightenment in all the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, since they lack the skillful means associated with the perfection of wisdom, there are only one or two who will be established on the level at which progress has become irreversible, but a larger number than that who will be established on the level of the śrāvakas and the pratyekabuddhas.

source: ཀཽ་ཤི་ཀ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་མེད་པ། བསམ་པ་ཞན་པ། མོས་པ་དམའ་བ། ཤེས་རབ་འཆལ་པ་ཅན་རྣམས་ཀྱིས་བསྒྲུབ་དཀའོ། །ཀཽ་ཤི་ཀ་ངས་འདི་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་བསྒྲིབས་པ་མེད་པས། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་།
en: If you ask why, Kauśika, it is hard for those who are indolent, those who are without perseverance, those who are of feeble intent, those who are of inferior resolve, and those who are stupid to attain unsurpassed, complete enlightenment. “

source: འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྤྱོད་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཐབས་མཁས་པ་དང་མི་ལྡན་པས། དེ་ལས་གཅིག་གམ་གཉིས་ཤིག་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་གནས་པར་འགྱུར་གྱི་དེ་ལས་ཕལ་ཆེར་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ལ་གནས་པར་འགྱུར་པ་མཐོང་ངོ་།
en: Kauśika, from here I see with my unobscured buddha eyes that although there are immeasurable, countless beings who are engaged in unsurpassed, complete enlightenment in all the world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, since they lack the skillful means associated with the perfection of wisdom, there are only one or two who will be established on the level at which progress has become irreversible, but a larger number than that who will be established on the level of the śrāvakas and the pratyekabuddhas.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་མེད་པ། བསམ་པ་ཞེན་པ་མོས་པ་དམའ་བ། ཤེས་རབ་འཆལ་པ་ཅན་རྣམས་ཀྱིས་བསྒྲུབ་པར་དཀའོ།
en: If you ask why, Kauśika, it is hard for those who are indolent, those who are without perseverance, those who are of feeble intent, those who are of inferior resolve, and those who are stupid to attain unsurpassed, complete enlightenment. {

source: །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུའམ།
en: Ki.

source: རིགས་ཀྱི་བུ་མོ་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་པ་དེ་དག་མྱུར་ཞིང་བདེ་བར། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་ན། ཡང་དང་ཡང་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་མཉན་པར་བྱའོ། །གཟུང་བར་བྱའོ། །བཅང་བར་བྱའོ།
en: II-III: 62} “Kauśika, so it is that if noble sons or noble daughters who actually enter upon unsurpassed, complete enlightenment wish to attain consummate buddhahood swiftly and easily in unsurpassed, complete enlightenment, they should repeatedly listen to this perfection of wisdom.

source: །ཀླག་པར་བྱའོ། །ཀུན་ཆུབ་པར་བྱའོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱའོ། །དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཟུང་ཞིང་བཅང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་ཤིང་བྲིས་ཏེ།
en: They should take up, uphold, recite, master, and focus their attention correctly on it.

source: མེ་ཏོག་དང་། བདུག་སྤོས་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་མང་པོས་རིམ་གྲོར་བྱའོ། །བཀུར་སྟིར་བྱའོ། །བསྟི་སྟང་དུ་བྱའོ། །མཆོད་པར་བྱའོ།
en: They should commit it to writing and they should serve, respect, honor, and worship it with flowers, incense, garlands, perfume, unguents, powders, robes, parasols, victory banners, and many ribbons.

source: །དགེ་བའི་ཆོས་གང་ཇི་སྙེད་པ་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་ནང་དུ་འདུ་སྟེ། དེ་དག་ཀྱང་གཟུང་བར་བྱ། བཅང་བར་བྱ། ཀླག་པར་བྱ། ཀུན་ཆུབ་པར་བྱ། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་སྟེ། འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: In addition, they should also take up, uphold, recite, master, and focus their attention correctly on all the virtuous attributes that are gathered within this perfection of wisdom.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་གང་ཇི་སྙེད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་ནང་དུ་འདུས་པ་དེ་དག་ཀྱང་གཟུང་བར་བྱའོ། །བཅང་བར་བྱའོ། །ཀླག་པར་བྱའོ། །ཀུན་ཆུབ་པར་བྱའོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་འདི་ལྟར་ཤེས་པར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཡང་། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: That is to say they should take up, uphold, recite, master, and focus their attention correctly on the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, [the other causal attributes], up to and including the noble eightfold path, [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, and also all the immeasurable attributes of the buddhas that are included within this perfection of wisdom.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་པོ་འདི་དག་དང་། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པ་དག་ལ་བསླབ་པ་མཛད་ཀྱིས། བདག་ཅག་གིས་ཀྱང་དེའི་རྗེས་སུ་བསླབ་པར་བྱའོ།
en: If you ask why, Kauśika, it is because those noble sons or noble daughters will know that when in the past the Tathāgata was engaged in the conduct of a bodhisattva, he also trained in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, the perfection of generosity, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the four applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, and that they themselves should also train in his wake.

source: །འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བདག་ཅག་གི་སྟོན་པའོ། །སངས་རྒྱས་ཀྱི་ཆོས་གཞན་ཚད་མེད་པའི་བར་དུ་ཡང་བདག་ཅག་གི་སྟོན་པ་སྟེ། དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བསྟན་པའོ། །རང་སངས་རྒྱས་དང་།
en: That is to say, this perfection of wisdom is their teacher, and the other [attributes], up to and including the immeasurable attributes of the buddhas, are also their teacher.

source: དགྲ་བཅོམ་པ་དང་། ཕྱིར་མི་འོང་བ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཀྱིས་བསྟན་པ་ཡང་འདི་ཡིན་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སློབ་སློབ་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: This perfection of wisdom has been revealed by the lord buddhas, and it has also been revealed by the pratyekabuddhas, the arhats, those will no longer be reborn, those who are destined for only one more rebirth, and those who have entered the stream to nirvāṇa.
